@mrburrito I can't reproduce with my setup using Terraform 0.12.9 and Vault provider with the original code you provided:

```hcl
// Ensure VAULT_ADDR and VAULT_TOKEN env vars are set
terraform {
  required_providers {
    vault = {
      source  = "hashicorp/vault"
      version = "2.13.0"
    }
  }
  required_version = "0.12.24"
}

resource "vault_mount" "database" {
  path                      = "database"
  type                      = "database"
  default_lease_ttl_seconds = "2592000" # 30 days
  max_lease_ttl_seconds     = "2592000" # 30 days
}

resource "vault_database_secret_backend_connection" "postgres" {
  allowed_roles = ["myrole"]
  backend       = vault_mount.database.path
  name          = "postgres-secret-backend"

  // Needed as SSL is disabled on postgres Docker container
  verify_connection = false

  postgresql {
    // sslmode=disable needed for the Postgres Go Client
    connection_url = "postgres://postgres:password@database:5432/postgres?sslmode=disable"
  }
}

resource "vault_database_secret_backend_role" "myrole" {
  backend = vault_mount.database.path
  name    = "myrole"
  db_name = "postgres"

  creation_statements = [
    "RESET ROLE;",
    "GRANT \"myrole\" TO \"rds_master_user\";",
    "CREATE OR REPLACE FUNCTION myfunc AS $$$$ BEGIN ... END; $$$$ LANGUAGE pgplsql;",
    "..."
  ]

}
```

Run logs:
```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vault_database_secret_backend_connection.postgres will be created
  + resource "vault_database_secret_backend_connection" "postgres" {
      + allowed_roles     = [
          + "myrole",
        ]
      + backend           = "database"
      + id                = (known after apply)
      + name              = "postgres-secret-backend"
      + verify_connection = false

      + postgresql {
          + connection_url       = "postgres://postgres:password@database:5432/postgres?sslmode=disable"
          + max_open_connections = 2
        }
    }

  # vault_database_secret_backend_role.myrole will be created
  + resource "vault_database_secret_backend_role" "myrole" {
      + backend             = "database"
      + creation_statements = [
          + "RESET ROLE;",
          + "GRANT \"myrole\" TO \"rds_master_user\";",
          + "CREATE OR REPLACE FUNCTION myfunc AS $$$$ BEGIN ... END; $$$$ LANGUAGE pgplsql;",
          + "...",
        ]
      + db_name             = "postgres"
      + id                  = (known after apply)
      + name                = "myrole"
    }

  # vault_mount.database will be created
  + resource "vault_mount" "database" {
      + accessor                  = (known after apply)
      + default_lease_ttl_seconds = 2592000
      + external_entropy_access   = false
      + id                        = (known after apply)
      + max_lease_ttl_seconds     = 2592000
      + path                      = "database"
      + seal_wrap                 = (known after apply)
      + type                      = "database"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vault_mount.database: Creating...
vault_mount.database: Creation complete after 0s [id=database]
vault_database_secret_backend_role.myrole: Creating...
vault_database_secret_backend_connection.postgres: Creating...
vault_database_secret_backend_role.myrole: Creation complete after 0s [id=database/roles/myrole]
vault_database_secret_backend_connection.postgres: Creation complete after 0s [id=database/config/postgres-secret-backend]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

I tested using multiple versions of Vault (1.4.0, 1.4.3, 1.5.0) and wasn't able to reproduce

My repo is here, using Docker: https://github.com/petems/vault-provider-psql-reproduction

Can you try again using these versions of TF and the provider?